docs: mermard diagram
Signed-off-by: Diego Caspi <diego.caspi@proton.me>
